Revit 2027 API
RenderingSettings.GetRenderingImageExposureSettings Method
 Returns an object that represents the rendering image exposure settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RenderingImageExposureSettings GetRenderingImageExposureSettings()
Public Function GetRenderingImageExposureSettings As RenderingImageExposureSettings
public:
RenderingImageExposureSettings^ GetRenderingImageExposureSettings()
member GetRenderingImageExposureSettings : unit -> RenderingImageExposureSettings
Return Value
RenderingImageExposureSettings
 The rendering image exposure settings.
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace